#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/knanao/ops/runs/run-8mVT9dwnRyvBR45x

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_kms_crypto_key.vault-seal will be created
  + resource "google_kms_crypto_key" "vault-seal" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "vault-seal"
      + purpose                    = "ENCRYPT_DECRYPT"

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # google_kms_crypto_key_iam_member.vault-seal will be created
  + resource "google_kms_crypto_key_iam_member" "vault-seal" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoOperator"
    }

  # google_kms_crypto_key_iam_member.vault-seal-admin will be created
  + resource "google_kms_crypto_key_iam_member" "vault-seal-admin" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.admin"
    }

  # google_kms_key_ring.vault-server will be created
  + resource "google_kms_key_ring" "vault-server" {
      + id       = (known after apply)
      + location = "global"
      + name     = "vault-server"
      + project  = (known after apply)
    }

  # google_project_iam_member.vault-server["roles/iam.serviceAccountAdmin"] will be created
  + resource "google_project_iam_member" "vault-server" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "knanao"
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # google_project_iam_member.vault-server["roles/iam.serviceAccountKeyAdmin"] will be created
  + resource "google_project_iam_member" "vault-server" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "knanao"
      + role    = "roles/iam.serviceAccountKeyAdmin"
    }

  # google_project_iam_member.vault-server["roles/resourcemanager.projectIamAdmin"] will be created
  + resource "google_project_iam_member" "vault-server" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "knanao"
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # google_secret_manager_secret.vault-server-config will be created
  + resource "google_secret_manager_secret" "vault-server-config" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "vault-server-config"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_iam_member.vault-server-config will be created
  + resource "google_secret_manager_secret_iam_member" "vault-server-config" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "vault-server-config"
    }

  # google_secret_manager_secret_version.vault-server-config will be created
  + resource "google_secret_manager_secret_version" "vault-server-config" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # google_service_account.vault-server will be created
  + resource "google_service_account" "vault-server" {
      + account_id   = "vault-server"
      + disabled     = false
      + display_name = "vault-server"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.vault-data will be created
  + resource "google_storage_bucket" "vault-data" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "knanao-vault-data"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # google_storage_bucket_iam_member.vault-data will be created
  + resource "google_storage_bucket_iam_member" "vault-data" {
      + bucket = "knanao-vault-data"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

Plan: 13 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @knanao, Action: `pull_request`*